5 + 3 = 8
10 + 7 = 17
-4 + 6 = 2
0 + 9 = 9
3.5 + 2.5 = 6
#2. - (დაკლება):
10 - 3 = 7
15 - 8 = 7
-5 - 10 = -15
9 - 4 = 5
7.5 - 2.5 = 5
#3. * (მრავლობითი):
5 * 3 = 15
10 * 2 = 20
-4 * 6 = -24
7 * 5 = 35
2.5 * 4 = 10
#4. / (გაყოფა):
10 / 2 = 5.0
20 / 4 = 5.0
-10 / 2 = -5.0
15 / 3 = 5.0
9 / 3 = 3.0
#5. ** (წინა გაბრტყელება):
2 ** 3 = 8
3 ** 2 = 9
4 ** 0 = 1
5 ** 4 = 625
10 ** 2 = 100
#6. % (მოზარდი):
10 % 3 = 1  ( "10 dividido por 3, sobra 1")
20 % 6 = 2  ("20 dividido por 6, sobra 2")
15 % 4 = 3  ("15 dividido por 4, sobra 3")
7 % 3 = 1  ("7 dividido por 3, sobra 1")
9 % 5 = 4  ("9 dividido por 5, sobra 4")