#მონაცემთა ტიპის კონვერტაცია: მონაცემთა ტიპის კონვერტაცია (type casting) საჭიროა მაშინ, როდესაც ერთ ტიპში არსებული მონაცემი გვინდა გადავაქციოთ სხვა ტიპში. მაგალითად:

#int -> str: თუ გვინდა რიცხვი ტექსტად წარმოვაჩინოთ, მაგალითად, str(5) გახდება "5".
#str -> int: თუ გვინდა ტექსტი რიცხვად გარდვაქმნათ, მაგალითად, int("3") გახდება 3.
#float -> int: თუ გვინდა მოიხსნას წერტილის შემდეგი ციფრები, მაგალითად, int(3.75) გახდება 3.
#int -> float: რიცხვის მეამურის შესაქმნელად, მაგალითად, float(5) გახდება 5.0.